import math
import random
# Задача-1:
lst_1 = [2, -5, 8, 9, -25, 25, 4]
lst_2 = [int(math.sqrt(x)) for x in lst_1 if x > 0 and math.sqrt(x) % 1 == 0]
print(lst_2)

# Задача-2:
data = (input('Введие дату по примеру 02.11.2019'))
day, month, year = [int(x) for x in data.split('.')]
days = {1: "первое", 2: "второе", 3: "третье", 4: "четвертое", 5: "пятое", 6: "шестое", 7: "седьмое",
        8: "восьмое", 9: "девятое", 10: "десятое", 11: "одиннадцатое", 12: "двеннадцатое", 13: "тринадцатое",
        14: "четырнадцатое", 15: "пятнадцатое", 16: "шестнадцатое", 17: "семнадцатое", 18: "восемнадцатое",
        19: "девятнадцатое", 20: "двадцатое", 21: "двадцать первое", 22: "двадцать второе",
        23: "двадцать третье", 24: "двадцать четвертое", 25: "двадцать пятое", 26: "двадцать шестое",
        27: "двадцать седьмое", 28: "двадцать восьмое", 29: "двадцать девятое",
        30: "тридцатое", 31: "тридцать первое"}
months = {1: "января", 2: "февраля", 3: "марта", 4: "апреля",
          5: "мая", 6: "июня", 7: "июля",
          8: "августа", 9: "сентября", 10: "октября",
          11: "ноября", 12: "декабря"}
print('{0} {1} {2} года'.format(days[day], months[month], year))

# Задача-3:
rand = []
n = int(input("Введите необходимое количество значений списка: "))
while len(rand) < n:
    rand.append(random.randint(-100, 100))
print(rand)

# Задача-4:
list1 = [1, 2, 4, 5, 6, 2, 5, 2]
list2 = set(list1)
print(list2)
list_2 = [1, 2, 4, 5, 6, 2, 5, 2]
list2_2 = [h for h in list_2 if list_2.count(h) == 1]
print(list2_2)
